app/Models/KaryawanModel.php

    public function getdata()
    {
        return $this->select('karyawan.nik, karyawan.kode_kartu, karyawan.nama_karyawan, karyawan.jenis_kelamin, karyawan.tgl_masuk, karyawan.shift, karyawan.id_bagian, bagian.nama_bagian')
            ->join('bagian', 'bagian.id_bagian=bagian.id_bagian')
            ->findAll();
---
SELECT `karyawan`.`nik`, `karyawan`.`kode_kartu`, `karyawan`.`nama_karyawan`, `karyawan`.`jenis_kelamin`, `karyawan`.`tgl_masuk`, `karyawan`.`shift`, `karyawan`.`id_bagian`, `bagian`.`nama_bagian`
FROM `karyawan`
JOIN `bagian` ON `bagian`.`id_bagian`=`bagian`.`id_bagian`